In [1]:
import pandas as pd
import numpy as np

In [2]:
#Unique, value_counts, sort_values, drop_duplicates

In [3]:
df = pd.DataFrame({'A':[100,44,56,99,85,100],
                  'B':['Panda','Snake','Snake','Rat','Dog','Panda']})
df

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog
5  100  Panda

In [4]:
df['B'].unique()

array(['Panda', 'Snake', 'Rat', 'Dog'], dtype=object)

In [123]:
df['B'].nunique()

4

In [5]:
df['B'].value_counts() #Ile razy wartość występuje w kolumnie

Panda    2
Snake    2
Rat      1
Dog      1
Name: B, dtype: int64

In [6]:
df['B'].value_counts(normalize=True)

Panda    0.333333
Snake    0.333333
Rat      0.166667
Dog      0.166667
Name: B, dtype: float64

In [7]:
df.sort_values(by='A')

     A      B
1   44  Snake
2   56  Snake
4   85    Dog
3   99    Rat
0  100  Panda
5  100  Panda

In [8]:
df.sort_values(by='A',ascending=False)

     A      B
0  100  Panda
5  100  Panda
3   99    Rat
4   85    Dog
2   56  Snake
1   44  Snake

In [128]:
#Drop_duplicates

In [9]:
df.drop_duplicates()

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog

In [10]:
#MULTI_INDEX

In [12]:
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

In [21]:
exam1 = [89,85,93,83]
exam2 = [74,56,44,92]
exam3=[67,59,79,84]
df = pd.DataFrame({'e1':exam1, 'e2':exam2, 'e3':exam3}, index=labels)
df['semestr 1'] = df['e1']+df['e2']+df['e3']
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [111]:
#Multi_index
#Sposób nr 1 – MultiIndex.from_tuples

In [22]:
df.index

Index(['Student A', 'Student B', 'Student C', 'Student D'], dtype='object')

In [23]:
schools = ['High School X','High School X','High School Y','High School Y']
multi_index_list = [(school,student) for school,student in zip(schools,df.index)]
multi_index_list
#print(type(multi_index_list[1]))

[('High School X', 'Student A'),
 ('High School X', 'Student B'),
 ('High School Y', 'Student C'),
 ('High School Y', 'Student D')]

In [39]:
df.index = pd.MultiIndex.from_tuples(multi_index_list,names=['School','Student'])
df

                         e1  e2  e3  semestr 1
School        Student
High School X Student A  89  74  67        230
              Student B  85  56  59        200
High School Y Student C  93  44  79        216
              Student D  83  92  84        259

In [40]:
#Multi_index
#Sposób nr 2 - funkcja set_index

In [52]:
exam1 = [89,85,93,83]
exam2 = [74,56,44,92]
exam3=[67,59,79,84]
df = pd.DataFrame({'e1':exam1, 'e2':exam2, 'e3':exam3}, index=labels)
df['semestr 1'] = df['e1']+df['e2']+df['e3']
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [53]:
df.set_index([pd.Index(['High School X','High School X','High School Y','High School Y']), df.index],inplace=True)

In [54]:
df

                         e1  e2  e3  semestr 1
High School X Student A  89  74  67        230
              Student B  85  56  59        200
High School Y Student C  93  44  79        216
              Student D  83  92  84        259

In [56]:
df.index.names = ['School','Student']
df

                         e1  e2  e3  semestr 1
School        Student
High School X Student A  89  74  67        230
              Student B  85  56  59        200
High School Y Student C  93  44  79        216
              Student D  83  92  84        259

In [58]:
df.loc['High School X'] #docieranie do informacji o studentach tylko z "High School X"

           e1  e2  e3  semestr 1
Student
Student A  89  74  67        230
Student B  85  56  59        200

In [59]:
df.loc['High School X'].iloc[1] #dostawanie sie do konkretnej pozycji z nizszego rzedu

e1            85
e2            56
e3            59
semestr 1    200
Name: Student B, dtype: int64

In [60]:
df.xs('High School Y')

           e1  e2  e3  semestr 1
Student
Student C  93  44  79        216
Student D  83  92  84        259

In [62]:
df.xs(('High School Y','Student D')) #dzięki funkcji xs() nawigujemy po potrzebnych danych bez kolejnych wywolań funkcji loc lub iloc

e1            83
e2            92
e3            84
semestr 1    259
Name: (High School Y, Student D), dtype: int64

In [63]:
df.xs('Student D',level='Student')

               e1  e2  e3  semestr 1
School
High School Y  83  92  84        259

In [27]:
#df.reset_index(drop=True,inplace=True)

In [28]:
#df

   e1  e2  e3  semestr 1
0  89  74  67        230
1  85  56  59        200
2  93  44  79        216
3  83  92  84        259

In [96]:
#

In [135]:
df_new_index2 = df.reset_index()
df_new_index2

          School    Student  e1  e2  e3  semester1
0  High School X  Student A  89  74  67        230
1  High School X  Student B  85  56  59        200
2  High School Y  Student C  93  44  79        216
3  High School Y  Student D  83  92  84        259

In [136]:
df_new_index2.index = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index2

                   School    Student  e1  e2  e3  semester1
Adrian      High School X  Student A  89  74  67        230
Bartłomiej  High School X  Student B  85  56  59        200
Celina      High School Y  Student C  93  44  79        216
Dagmara     High School Y  Student D  83  92  84        259

In [141]:
df_new_index2.drop('School',inplace=True,axis=1)

In [142]:
df_new_index2

              Student  e1  e2  e3  semester1
Adrian      Student A  89  74  67        230
Bartłomiej  Student B  85  56  59        200
Celina      Student C  93  44  79        216
Dagmara     Student D  83  92  84        259

In [143]:
#Funkcja rename – zmiana etykiet kolumn i wierszy

In [145]:
df_new_index2.rename(columns={'e1':'exam1','e2':'exam2','e3':'exam3'})

              Student  exam1  exam2  exam3  semester1
Adrian      Student A     89     74     67        230
Bartłomiej  Student B     85     56     59        200
Celina      Student C     93     44     79        216
Dagmara     Student D     83     92     84        259

In [146]:
#Unique, value_counts, sort_values, drop_duplicates

In [147]:
df = pd.DataFrame({'A':[100,44,56,99,85,100],
                  'B':['Panda','Snake','Snake','Rat','Dog','Panda']})

In [148]:
df

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog
5  100  Panda

In [149]:
df['B'].unique()

array(['Panda', 'Snake', 'Rat', 'Dog'], dtype=object)

In [150]:
df['B'].nunique()

4

In [151]:
df['B'].value_counts()

Panda    2
Snake    2
Rat      1
Dog      1
Name: B, dtype: int64

In [152]:
df['B'].value_counts(normalize=True)

Panda    0.333333
Snake    0.333333
Rat      0.166667
Dog      0.166667
Name: B, dtype: float64

In [153]:
df.sort_values(by='A')

     A      B
1   44  Snake
2   56  Snake
4   85    Dog
3   99    Rat
0  100  Panda
5  100  Panda

In [154]:
df.sort_values(by='A',ascending=False)

     A      B
0  100  Panda
5  100  Panda
3   99    Rat
4   85    Dog
2   56  Snake
1   44  Snake

In [155]:
df.drop_duplicates()

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog